In [1]:
import pandas as pd

## Data Type 1: Series

Series are 1-Dimensional Data Type

In [6]:
car_brands = pd.Series(["BMW", "Honda", "Toyota"])
car_colors = pd.Series(["Black", "Blue", "White"])

In [7]:
car_brands

0       BMW
1     Honda
2    Toyota
dtype: object

In [8]:
car_colors

0    Black
1     Blue
2    White
dtype: object

## Data Type 2: DataFrame

DataFrame are 2-Dimensional Data Type

In [9]:
car_df = pd.DataFrame({ "Car Brands" : car_brands, "Color" : car_colors })

In [10]:
car_df

  Car Brands  Color
0        BMW  Black
1      Honda   Blue
2     Toyota  White

## Importing From File

In [11]:
car_df_imported = pd.read_csv("car-sales.csv")

In [13]:
car_df_imported

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Exporting File

In [14]:
car_df_imported.to_csv("car-sales-exported.csv", index=False)

In [15]:
car_df_imported = pd.read_csv("car-sales-exported.csv")
car_df_imported

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

## Describing Data

In [16]:
car_df_imported.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [17]:
car_df_imported.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [18]:
car_df_imported.index

RangeIndex(start=0, stop=10, step=1)

In [19]:
car_df_imported.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [20]:
car_df_imported.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [22]:
car_df_imported["Doors"].mean()

4.0

In [23]:
car_df_imported["Doors"].sum()

40

In [24]:
len(car_df_imported)

10

## Viewing and Selecting Data

In [26]:
car_df_imported.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [27]:
car_df_imported.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [28]:
# loc vs iloc
animals = pd.Series(["cat", "dog", "mouse", "parrot", "whale"], index = [0, 3, 9, 8, 3])
animals

0       cat
3       dog
9     mouse
8    parrot
3     whale
dtype: object

In [ ]:
animals.loc[3]